Revit 2027 API
ExtendedPropertiesLink.LoadFrom Method
 Reloads the ExtendedPropertiesLink with the latest information from the server using the specified ExternalResourceReference.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkLoadResult LoadFrom(
	ExternalResourceReference externalReference
)
Public Function LoadFrom (
	externalReference As ExternalResourceReference
) As LinkLoadResult
public:
LinkLoadResult^ LoadFrom(
	ExternalResourceReference^ externalReference
)
member LoadFrom :
        externalReference : ExternalResourceReference -> LinkLoadResult
Parameters
externalReference ExternalResourceReference
 The location of the extended properties.
Return Value
LinkLoadResult
Exceptions
Exception | Condition
ArgumentException |  The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. -or- The ExternalResourceReference (externalReference) is not in a format that is supported by its server. -or- The given externalReference does not refer to a server that supports extended properties.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This ExtendedPropertiesLink does not contain an external resource reference compatible with the ExternalResourceType. -or- The document does not support extended properties links.
ModificationForbiddenException |  The document containing this ExtendedPropertiesLink is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this ExtendedPropertiesLink is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document containing this ExtendedPropertiesLink has no open transaction.
See Also
Reference
ExtendedPropertiesLink Class
Autodesk.Revit.DB.ExternalData Namespace